tests/fixtures/data/payouts.json

{
    "create": {
        "destination": "tb1qz28nh6ukmyumqdvysnd726f2yw77yt5ch39aga",
        "amount": 5
    },
    "patch": {
        "max_fee": 1,
        "metadata": {
            "test": "test"
        }
    },
    "response": {
        "amount": "5.00",
        "currency": "USD",
        "destination": "tb1qz28nh6ukmyumqdvysnd726f2yw77yt5ch39aga",
        "max_fee": null,
        "notification_url": "",
        "status": "pending",
        "tx_hash": null,
        "used_fee": null,
        "metadata": {}
    },
    "count": 1
}
